In [6]:
import pandas as pd
from sqlalchemy import create_engine

In [4]:
df = pd.read_csv('taxi+_zone_lookup.csv')

In [12]:
print(pd.io.sql.get_schema(df,name='tax_zone_data'))

CREATE TABLE "tax_zone_data" (
"LocationID" INTEGER,
  "Borough" TEXT,
  "Zone" TEXT,
  "service_zone" TEXT
)

In [7]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [8]:
df.head(n=0).to_sql(name='taxi_zone_data', con=engine,if_exists='replace')

0

In [14]:
df.to_sql(name='taxi_zone_data', con=engine,if_exists='append')

265

In [5]:
df

     LocationID        Borough                     Zone service_zone
0             1            EWR           Newark Airport          EWR
1             2         Queens              Jamaica Bay    Boro Zone
2             3          Bronx  Allerton/Pelham Gardens    Boro Zone
3             4      Manhattan            Alphabet City  Yellow Zone
4             5  Staten Island            Arden Heights    Boro Zone
..          ...            ...                      ...          ...
260         261      Manhattan       World Trade Center  Yellow Zone
261         262      Manhattan           Yorkville East  Yellow Zone
262         263      Manhattan           Yorkville West  Yellow Zone
263         264        Unknown                       NV          NaN
264         265        Unknown                      NaN          NaN

[265 rows x 4 columns]